<!-- @run-terraform -->
<!-- @run-terraform:start:dev -->
## Results for dev – ❗ `CHANGED` ❗
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/604bed09-6944-4583-8696-6f46417dd7cb/terraform-bin plan -var=image=ghcr.io/kartverket/skiperator-controller:sha-30c257070dee8571f8f0271b6ef58fe4f80d77f4 -input=false -no-color -detailed-exitcode -out=plan-dev.tfplan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_deployment_v1.deployment will be updated in-place
  ~ resource "kubernetes_deployment_v1" "deployment" {
        id               = "skiperator-system/skiperator"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/kartverket/skiperator-controller:sha-c59ec358e49c01d5a5c339354e52e614492bad5d" -> "ghcr.io/kartverket/skiperator-controller:sha-30c257070dee8571f8f0271b6ef58fe4f80d77f4"
                        name                       = "skiperator"
                        # (8 unchanged attributes hidden)

                        # (6 unchanged blocks hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.cluster_role will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_role" {
      ~ manifest = {
          ~ rules      = [
                # (3 unchanged elements hidden)
                {
                    apiGroups = [
                        "autoscaling",
                    ]
                    resources = [
                        "horizontalpodautoscalers",
                    ]
                    verbs     = [
                        "create",
                        "delete",
                        "get",
                        "list",
                        "patch",
                        "update",
                        "watch",
                    ]
                },
              + {
                  + apiGroups = [
                      + "cert-manager.io",
                    ]
                  + resources = [
                      + "certificates",
                    ]
                  + verbs     = [
                      + "create",
                      + "delete",
                      + "get",
                      + "list",
                      + "patch",
                      + "update",
                      + "watch",
                    ]
                },
                {
                    apiGroups = [
                        "coordination.k8s.io",
                    ]
                    resources = [
                        "leases",
                    ]
                    verbs     = [
                        "create",
                        "get",
                        "update",
                    ]
                },
                # (8 unchanged elements hidden)
            ]
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata        = {
              ~ creationTimestamp          = null -> (known after apply)
                name                       = "skiperator"
                # (14 unchanged elements hidden)
            }
          ~ rules           = [
                # (3 unchanged elements hidden)
                {
                    apiGroups       = [
                        "autoscaling",
                    ]
                    nonResourceURLs = null
                    resourceNames   = null
                    resources       = [
                        "horizontalpodautoscalers",
                    ]
                    verbs           = [
                        "create",
                        "delete",
                        "get",
                        "list",
                        "patch",
                        "update",
                        "watch",
                    ]
                },
              + {
                  + apiGroups       = [
                      + "cert-manager.io",
                    ]
                  + nonResourceURLs = null
                  + resourceNames   = null
                  + resources       = [
                      + "certificates",
                    ]
                  + verbs           = [
                      + "create",
                      + "delete",
                      + "get",
                      + "list",
                      + "patch",
                      + "update",
                      + "watch",
                    ]
                },
                {
                    apiGroups       = [
                        "coordination.k8s.io",
                    ]
                    nonResourceURLs = null
                    resourceNames   = null
                    resources       = [
                        "leases",
                    ]
                    verbs           = [
                        "create",
                        "get",
                        "update",
                    ]
                },
                # (6 unchanged elements hidden)
                {
                    apiGroups       = [
                        "security.istio.io",
                    ]
                    nonResourceURLs = null
                    resourceNames   = null
                    resources       = [
                        "peerauthentications",
                    ]
                    verbs           = [
                        "create",
                        "delete",
                        "get",
                        "list",
                        "patch",
                        "update",
                        "watch",
                    ]
                },
              ~ {
                  ~ nonResourceURLs = null -> (known after apply)
                  ~ resourceNames   = null -> (known after apply)
                    # (3 unchanged elements hidden)
                },
            ]
            # (3 unchanged elements hidden)
        }
    }

  # kubernetes_manifest.custom_resource_definition will be updated in-place
  ~ resource "kubernetes_manifest" "custom_resource_definition" {
      ~ object   = {
          ~ metadata   = {
              ~ creationTimestamp          = null -> (known after apply)
                name                       = "applications.skiperator.kartverket.no"
                # (14 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

#### Next action 🚀
Changes detected. Will run Terraform apply job on merge to refs/heads/main

*Pusher: @hagen93, Working Directory: `deployment`, Commit: 30c257070dee8571f8f0271b6ef58fe4f80d77f4, Generated at: `31.8.2022, 11:08:36`*
<!-- @run-terraform:end:dev -->